app/views/menus/_menu.html.erb

SELECT "items".* FROM "items" WHERE "items"."menu_id" = $1  [["menu_id", 1]]
---
  <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
    <% menu.items&.each do |item| %>