app/views/shared/_navbar.html.erb

            <i class="fa-solid fa-cart-shopping text-4xl text-red-600"></i>
              <span class="absolute top-0 right-0 bg-white text-red-600 rounded-full text-xs border border-color-red-600" style="padding: 0px 6px 0px 6px; background-color: white; font-size: 13px;"><%= Order.count %></span>
---
SELECT COUNT(*) FROM "orders"