app/views/orders/_order.html.erb

      <strong class="block font-medium mb-1 text-xl">Order Number:</strong>
      <div class="text-lg"><%= order.order_number %></div>
---
SELECT "orders".* FROM "orders"


    <% order.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 1]]