app/views/orders/show.html.erb

    </div>
    <% @order.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 24]]