app/views/items/_form.html.erb

  <%= form.label :select_menu %>
  <%= form.select :menu_id, options_for_select(Menu.pluck(:title, :id), selected: @item.menu), {prompt: "Select Menu for Item"}, class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full", required: true %>
---
SELECT "menus"."title", "menus"."id" FROM "menus"