app/controllers/application_controller.rb

INSERT INTO "orders" ("status", "created_at", "updated_at", "order_number", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["created_at", "2023-12-18 11:10:37.468706"], ["updated_at", "2023-12-18 11:10:37.468706"], ["order_number", 244013], ["user_id", 1]]
---
    def create_current_order
        order = current_user.orders.create(status: "in_progress", order_number: generate_order_number)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
    def current_order
        Order.find_by(id: session[:current_order_id])