app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

INSERT INTO "items" ("name", "description", "price", "quantity", "available", "created_at", "updated_at", "menu_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "name" = $1, "description" = $2, "price" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["name", "Easter Anderson"], ["description", "Autem minus laboriosam sit atque quaerat nam."], ["price", 12], ["updated_at", "2023-12-25 19:22:42.097908"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]
---
  def destroy
    @item.destroy!

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find(params[:id])