app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menus = Menu.all

INSERT INTO "menus" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @menu = Menu.new(menu_params)

    respond_to do |format|
      if @menu.save

DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 3]]
---
  def destroy
    @menu.destroy!

SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_menu
      @menu = Menu.find(params[:id])