app/controllers/orders_controller.rb

INSERT INTO "items" ("name", "description", "price", "quantity", "available", "created_at", "updated_at", "menu_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "orders" ("status", "created_at", "updated_at", "order_number") VALUES ($1, $2, $3, $4) RETURNING "id"  [["status", 0], ["created_at", "2023-12-16 19:12:42.752293"], ["updated_at", "2023-12-16 19:12:42.752293"], ["order_number", nil]]
INSERT INTO "order_items" ("item_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 1], ["order_id", 8], ["created_at", "2023-12-16 19:18:49.515472"], ["updated_at", "2023-12-16 19:18:49.515472"]]
---
  def update_cart
    @current_order.order_items.create(item_id: params["id"])

UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", 1], ["updated_at", "2023-12-25 19:30:49.562133"], ["id", 25]]
---
  def complete_order
    respond_to do |format|
      if @order.update(status: "completed")

DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 24]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 36]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 26]]
---
  def destroy
    @order_items.destroy_all
    @order.destroy

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 24]]
---
  def set_order_items
    @order_items = OrderItem.where(order_id: params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])