app/controllers/order_histories_controller.rb

  def index
    @order_histories = OrderHistory.all
---
SELECT "order_histories".* FROM "order_histories"

    def set_order_history
      @order_history = OrderHistory.find(params[:id])
---
SELECT "order_histories".* FROM "order_histories" WHERE "order_histories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]